app/controllers/bloggers_controller.rb

  def index
    @bloggers = Blogger.all
---
SELECT  "bloggers".* FROM "bloggers" ORDER BY "bloggers"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
    @blogger = Blogger.find(params[:id])
---
SELECT  "bloggers".* FROM "bloggers" WHERE "bloggers"."id" = ? ORDER BY name ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def create
    blogger_params = params.require(:blogger).permit(:name, :bio, :age)
    @new_blogger = Blogger.create(blogger_params)
---
INSERT INTO "bloggers" ("name", "bio", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["bio", "Test"], ["age", 0], ["created_at", "2021-03-02 00:45:20.414883"], ["updated_at", "2021-03-02 00:45:20.414883"]]