app/controllers/destinations_controller.rb

  def index
    @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations" ORDER BY name ASC

  def show
    @destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? ORDER BY name ASC LIMIT ?  [["id", 23], ["LIMIT", 1]]