app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY title ASC

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY title ASC LIMIT ?  [["id", 23], ["LIMIT", 1]]

  def new
    @post = Post.new
    @destinations = Destination.all
    @bloggers = Blogger.all
---
SELECT "destinations".* FROM "destinations" ORDER BY name ASC
SELECT "bloggers".* FROM "bloggers" ORDER BY name ASC

  def create
    post_params = params.require(:post).permit(:title, :content, :likes, :blogger_id, :destination_id)
    @new_post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "content", "likes", "blogger_id", "destination_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "sdfsdf"], ["content", "sdfsdfsd"], ["likes", 1], ["blogger_id", 2], ["destination_id", 8], ["created_at", "2021-03-02 02:26:33.272844"], ["updated_at", "2021-03-02 02:26:33.272844"]]